# -*-coding:utf-8-*-


class FinalList:
    """
    list
    """
    # 匿名好友无法输入的名称, 等值 非模糊
    DIRTY_LIST = ['1', '2', '3']


class FinalMap:
    """
    map
    """
    # 省级名称与vector-map对应code字典
    # "香港","澳门","台湾省" 没有
    VECTOR_MAP_ADDRESS_CODE_MAP = {'江苏省': 'CN-32', '贵州省': 'CN-52', '云南省': 'CN-53', '重庆市': 'CN-50', '四川省': 'CN-51', '上海市': 'CN-31', '西藏': 'CN-54', '浙江省': 'CN-33', '内蒙古': 'CN-15', '山西省': 'CN-14', '福建省': 'CN-', '天津市': 'CN-12', '河北省': 'CN-13', '北京市': 'CN-11', '安徽省': 'CN-34', '江西省': 'CN-36', '山东省': 'CN-37', '河南省': 'CN-41', '湖南省': 'CN-43', '湖北省': 'CN-42', '广西': 'CN-45', '广东省': 'CN-44', '海南省': 'CN-46', '新疆': 'CN-65', '宁夏': 'CN-64', '青海省': 'CN-63', '甘肃省': 'CN-62', '陕西省': 'CN-61', '黑龙江省': 'CN-23', '吉林省': 'CN-22', '辽宁省': 'CN-21'}
